Tekla Open API Reference for Tekla Structures 2025
ModelObject.GetUserProperty Method (String, Int32)
 Retrieves an integer property for the model object.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool GetUserProperty(
	string name,
	ref int value
)
Public Function GetUserProperty (
	name As String,
	ByRef value As Integer
) As Boolean
Parameters
name
Type: System.String
The name of the property to be retrieved.
value
Type: System.Int32
The return value.
Return Value
Type: Boolean
True if the value was returned successfully.
See Also
Reference
ModelObject Class
GetUserProperty Overload
Tekla.Structures.Model Namespace